About:27
these:1033
documents:39
*********************:3
These:536
are:9640
generated:285
from:6050
reStructuredText:10
sources:48
by:13204
Sphinx,:2
a:33872
document:219
processor:19
specifically:44
written:651
for:15838
the:77295
Python:7229
documentation.:132
Development:63
of:28430
documentation:604
and:26860
its:1703
toolchain:3
is:30051
an:9270
entirely:40
volunteer:3
effort,:3
just:608
like:1114
itself.:106
If:5248
you:4023
want:620
to:34474
contribute,:1
please:74
take:348
look:225
at:2329
Dealing:6
with:9369
Bugs:12
page:153
information:806
on:6806
how:750
do:1021
so.:24
New:2680
volunteers:5
always:1021
welcome!:1
Many:79
thanks:26
go:94
to::97
*:26275
Fred:14
L.:12
Drake,:9
Jr.,:4
creator:11
original:372
toolset:4
writer:34
much:236
content;:1
Docutils:3
project:72
creating:347
suite;:2
Fredrik:29
Lundh:13
his:19
Alternative:20
Reference:104
which:4123
Sphinx:21
got:22
many:507
good:131
ideas.:2
Contributors:2
Documentation:193
========================================:20
people:74
have:2870
contributed:104
language,:37
standard:1013
library,:70
See:1568
Misc/ACKS:1
in:25253
source:792
distribution:193
partial:62
list:1889
contributors.:2
It:1777
only:2399
input:572
contributions:9
community:12
that:10794
has:3100
such:1291
wonderful:3
--:687
Thank:2
You!:1
*****************:12
mature:1
programming:81
language:166
established:16
reputation:1
stability.:1
In:1804
order:696
maintain:43
this:5496
reputation,:1
developers:73
would:801
know:155
any:2130
deficiencies:1

turtle.setposition(x,:1
**x**:4
pair/vector:3
**y**:4
"Vec2D":3
"pos()").:1
pen:10
tp:2
turtle.pos():7
turtle.setpos(60,30):1
(60.00,30.00):1
turtle.setpos((20,80)):1
(20.00,80.00):1
turtle.setpos(tp):1
turtle.setx(x):1
(0.00,240.00):2
turtle.setx(10):1
(10.00,240.00):1
turtle.sety(y):1
(0.00,40.00):1
turtle.sety(-10):1
(0.00,-10.00):2
turtle.setheading(to_angle):1
turtle.seth(to_angle):1
**to_angle**:1
*to_angle*.:1
directions:4
+---------------------+----------------------+:5
|=====================|======================|:1
north:3
south:2
turtle.setheading(90):1
90.0:5
turtle.home():11
start-orientation:1
"mode()").:2
turtle.circle(radius,:1
extent=None,:1
steps=None):1
**radius**:1
**extent**:1
**steps**:1
*radius*.:1
*radius*:2
turtle;:1
*extent*:3
circle.:2
circle,:1
clockwise:2
*extent*.:1
approximated:6
inscribed:1
polygon,:6
*steps*:1
polygons.:1
turtle.circle(50):1
(-0.00,0.00):1
turtle.circle(120,:1
180):1
semicircle:1
180.0:1
turtle.dot(size=None,:1
*color):1
**size**:2
**color**:1
colorstring:2
diameter:1
*color*.:1
pensize+4:1
2*pensize:1
turtle.dot():1
turtle.fd(50);:2
turtle.dot(20,:1
"blue");:1
turtle.fd(50):8
(100.00,-0.00):1
turtle.stamp():3
Stamp:1
canvas:17
stamp_id:1
stamp,:1
"clearstamp(stamp_id)".:1
turtle.color("blue"):2
turtle.clearstamp(stampid):1
**stampid**:1
*stampid*.:1
(150.00,-0.00):1
astamp:1
(200.00,-0.00):2
turtle.clearstamp(astamp):1
turtle.clearstamps(n=None):1
**n**:2
first/last:1
stamps.:2
stamps,:3
turtle.stamp();:1
turtle.fd(30):2
turtle.clearstamps(2):1
turtle.clearstamps(-2):1
turtle.clearstamps():1
turtle.undo():2
action(s).:1
undobuffer.:3
turtle.lt(80):1
turtle.speed(speed=None):1
**speed**:1
0..10:2
speedstring:1
0..10.:1
Speedstrings:1
speedvalues:1
"fastest"::1
"fast"::1
"normal"::1
"slow"::1
"slowest"::1
Speeds:2
turning.:1
Attention::1
*speed*:1
forward/back:1
left/right:7
instantly.:1
turtle.speed():3
turtle.speed('normal'):1
turtle.speed(9):1
(x,y):3
vector).:1
(440.00,-0.00):1
turtle.towards(x,:1
(x,y),:2
"standard"/"world":1
"logo".:1
turtle.goto(10,:1
turtle.towards(0,0):1
225.0:1
turtle.xcor():1
turtle.left(50):1
turtle.forward(100):2
(64.28,76.60):1
print(round(turtle.xcor(),:1
64.27876:1
turtle.ycor():1
turtle.left(60):2
print(turtle.pos()):1
(50.00,86.60):1
print(round(turtle.ycor(),:1
86.60254:1
turtle.left(67):1
turtle.distance(x,:1
vector,:1
turtle,:6
turtle.distance(30,40):1
50.0:2
turtle.distance((30,40)):1
joe:2
Turtle():3
joe.forward(77):1
turtle.distance(joe):1
77.0:1
turtle.degrees(fullcircle=360.0):1
**fullcircle**:1
"degrees":1
360:1
turtle.left(90):2
grad:1
gon,:1
gradian:1
1/100-th:1
angle.):1
turtle.degrees(400.0):1
100.0:3
turtle.degrees(360):1
turtle.radians():2
"degrees(2*math.pi)".:1
1.5707963267948966:1
turtle.pendown():2
turtle.pd():1
turtle.down():1
moving.:5
turtle.penup():4
turtle.pu():1
turtle.up():1
turtle.pensize(width=None):1
turtle.width(width=None):1
**width**:2
thickness:1
resizemode:5
turtleshape:10
polygon:7
thickness.:1
pensize:1
turtle.pensize():1
turtle.pensize(10):1
turtle.pen(pen=None,:1
**pendict):1
**pen**:1
**pendict**:1
keyword-arguments:1
pen's:2
"pen-dictionary":1
"shown"::1
True/False:3
"pendown"::1
"pencolor"::1
color-string:2
color-tuple:2
"fillcolor"::1
"pensize"::1
"speed"::1
"resizemode"::1
"noresize":2
"stretchfactor"::1
"outline"::1
"tilt"::1
pen-state.:1
Moreover:1
keyword-arguments.:1
turtle.pen(fillcolor="black",:1
pencolor="red",:1
pensize=10):1
sorted(turtle.pen().items()):1
[('fillcolor',:3
('outline',:3
('pencolor',:3
('pendown',:1
('pensize',:1
('resizemode',:1
'noresize'),:1
('shearfactor',:1
0.0),:1
('shown',:1
('speed',:1
9),:3
('stretchfactor',:1
1.0)),:1
('tilt',:1
0.0)]:1
penstate=turtle.pen():1
turtle.color("yellow",:1
""):2
sorted(turtle.pen().items())[:3]:2
'yellow')]:1
turtle.pen(penstate,:1
fillcolor="green"):1
'green'),:1
'red')]:1
turtle.isdown():3
turtle.pencolor(*args):1
pencolor.:2
pencolor:7
color/pencolor/fillcolor:2
"pencolor(colorstring)":1
*colorstring*,:2
""red"",:2
""yellow"",:2
""#33cc8c"".:2
"pencolor((r,:1
b))":2
0..colormode,:2
colormode:4
"colormode()").:2
"pencolor(r,:1
0..colormode.:2
outline:5
colormode():1
turtle.pencolor():6
turtle.pencolor("brown"):1
'brown':1
0.8,:2
0.55):1
turtle.pencolor(tup):1
0.5490196078431373):1
colormode(255):1
(51.0,:1
204.0,:1
140.0):1
turtle.pencolor('#32c18f'):1
(50.0,:3
193.0,:3
143.0):3
turtle.fillcolor(*args):1
fillcolor.:3
fillcolor:8
"fillcolor(colorstring)":1
"fillcolor((r,:1
"fillcolor(r,:1
turtle.fillcolor("violet"):1
turtle.fillcolor():3
'violet':1
turtle.fillcolor((50,:1
193,:1
143)):1
Integers,:1
turtle.fillcolor('#ffffff'):1
(255.0,:1
255.0,:1
255.0):1
turtle.color(*args):1
"fillcolor()".:1
"color(colorstring)",:1
"color((r,g,b))",:1
"color(r,g,b)":1
Inputs:2
"pencolor()",:1
pencolor,:1
"color(colorstring1,:1
colorstring2)",:1
"color((r1,g1,b1),:1
(r2,g2,b2))":1
"pencolor(colorstring1)":1
"fillcolor(colorstring2)":1
analogously:2
turtle.color("red",:1
"green"):1
turtle.color():1
'green'):1
color("#285078",:1
"#a0c8f0"):1
color():1
((40.0,:1
80.0,:1
120.0),:1
(160.0,:1
200.0,:1
240.0)):1
"colormode()".:1
turtle.filling():1
fillstate:1
filling,:1
else).:1
turtle.begin_fill():3
turtle.filling()::1
turtle.pensize(5):1
turtle.pensize(3):1
filled.:1
turtle.end_fill():2
"begin_fill()".:1
self-intersecting:1
polygons:2
overlap,:1
overlaps.:1
yellow:2
turtle.color("black",:1
"red"):2
turtle.circle(80):1
turtle.reset():6
drawings:5
re-center:1
turtle.goto(0,-22):1
turtle.left(100):1
(0.00,-22.00):1
turtle.clear():2
turtle.write(arg,:1
move=False,:1
align='left',:1
font=('Arial',:1
'normal')):1
**arg**:1
**move**:1
**align**:1
"center":2
**font**:1
(fontname,:1
fontsize,:1
fonttype):1
("left",:1
"right"):1
*move*:2
bottom-right:1
turtle.write("Home:1
align="center"):1
turtle.write((0,0),:1
~~~~~~~~~~:3
turtle.hideturtle():3
turtle.ht():1
drawing,:1
observably.:1
turtle.showturtle():3
turtle.st():1
turtle.isvisible():3
turtle.shape(name=None):1
shapename:1
TurtleScreen's:2
shapes::1
"arrow",:1
"turtle",:1
"circle",:1
"square",:1
"triangle",:1
"classic".:1
"register_shape()".:1
turtle.shape():2
'classic':1
turtle.shape("turtle"):1
'turtle':1
turtle.resizemode(rmode=None):1
**rmode**:1
"auto",:2
"noresize".:1
